In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel("Titanic1.xlsx")
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace = True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
dummies = pd.get_dummies(df.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
y = df.Survived
X = df.drop('Survived',axis='columns')

In [7]:
X = pd.concat([X,dummies],axis='columns')
X.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [9]:
X.drop('Sex',axis='columns',inplace=True)
X.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [10]:
X.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [13]:
X['Age'].head(15)

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
Name: Age, dtype: float64

In [17]:
X.fillna(X.Age.mean(), axis ='columns', inplace=True)
X.head(15)

    Pclass        Age     Fare  female  male
0        3  22.000000   7.2500       0     1
1        1  38.000000  71.2833       1     0
2        3  26.000000   7.9250       1     0
3        1  35.000000  53.1000       1     0
4        3  35.000000   8.0500       0     1
5        3  29.699118   8.4583       0     1
6        1  54.000000  51.8625       0     1
7        3   2.000000  21.0750       0     1
8        3  27.000000  11.1333       1     0
9        2  14.000000  30.0708       1     0
10       3   4.000000  16.7000       1     0
11       1  58.000000  26.5500       1     0
12       3  20.000000   8.0500       0     1
13       3  39.000000  31.2750       0     1
14       3  14.000000   7.8542       1     0

In [18]:
X.isnull().sum()

Pclass    0
Age       0
Fare      0
female    0
male      0
dtype: int64

In [42]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

In [43]:
len(X_train)

712

In [44]:
len(X_test)

179

In [45]:
len(X)

891

In [46]:
from sklearn.naive_bayes import GaussianNB
model =  GaussianNB()

In [47]:
model.fit(X_train, y_train)

GaussianNB()

In [48]:
model.score(X_test, y_test)*100

84.91620111731844

In [49]:
X_test[:10]

     Pclass        Age      Fare  female  male
818       3  43.000000    6.4500       0     1
650       3  29.699118    7.8958       0     1
305       1   0.920000  151.5500       0     1
870       3  26.000000    7.8958       0     1
789       1  46.000000   79.2000       0     1
859       3  29.699118    7.2292       0     1
360       3  40.000000   27.9000       0     1
70        2  32.000000   10.5000       0     1
165       3   9.000000   20.5250       0     1
642       3   2.000000   27.9000       1     0

In [50]:
y_test[:10]

818    0
650    0
305    1
870    0
789    0
859    0
360    0
70     0
165    1
642    0
Name: Survived, dtype: int64

In [51]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 0, 0, 0, 0, 0, 1], dtype=int64)

In [52]:
model.predict_proba(X_test[:10])

array([[0.98861776, 0.01138224],
       [0.98870439, 0.01129561],
       [0.00115726, 0.99884274],
       [0.98826419, 0.01173581],
       [0.59211452, 0.40788548],
       [0.98865954, 0.01134046],
       [0.98823152, 0.01176848],
       [0.97534741, 0.02465259],
       [0.98276729, 0.01723271],
       [0.06132212, 0.93867788]])

In [ ]:
#0.9886% says that the person didn't survived but 0.0113% says that it will survived that'swhy it is showing 0... 
#0.9887% says that the person didn't survived but 0.0112% says that it will survivedthat'swhy it is showing 0...
#0.0011% says that the person didn't survived but 0.9988% says that it will survivedthat'swhy it is showing 1...